routes/web.php




    Route::get('authors/{author:username}', function (User $author) {


        return view('posts', [
           'posts' => $author->post
        ]);

    });
---
SELECT * FROM `posts` WHERE `posts`.`user_id` = 4 and `posts`.`user_id` IS not NULL