app/View/Components/categoryDropdown.php

SELECT * FROM `categories`
SELECT * FROM `categories` WHERE `slug` = 'optio-eius-at-dolor-quas-nesciunt-enim' LIMIT 1
---
    public function render()
    {
        return view('components.category-dropdown', [
          'categories' => Category::all(),
          'currentCategory' => Category::firstWhere('slug', request('category'))
        ]);