app/Http/Controllers/PostController.php

    public function index()
    {


        return view('posts', [
            'posts' => Post::latest()->filter(request(['search']), 'category')->get(),
            'categories' => Category::all(),
            'currentCategory' => Category::firstWhere('slug', request('category'))
        ]);
---
SELECT * FROM `posts` WHERE exists (SELECT * FROM `categories` WHERE `posts`.`category_id` = `categories`.`id` and `slug` = 'optio-eius-at-dolor-quas-nesciunt-enim') ORDER BY `created_at` DESC LIMIT 6 offset 0
SELECT * FROM `categories`
SELECT * FROM `categories` WHERE `slug` = 'blanditiis-necessitatibus-fugit-officiis-quis' LIMIT 1