app/Http/Controllers/PostController.php

    public function index()
    {


        return view('posts.index', [
            'posts' => Post::latest()->filter(request(['search', 'category']))->paginate(6)->withQueryString()

        ]);
---
SELECT * FROM `categories` WHERE `categories`.`id` in (6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
SELECT count(*) as aggregate FROM `posts`