app/Http/Controllers/RegisterController.php

    public function store()
    {

      $attributes = request()->validate([
          'name' => 'required|max:255',
          'username' => 'required|min:3|max:255|unique:users,username',
          'email' => 'required|email|max:255|unique:users,email',
          'password' =>[ 'required', 'min:7', 'max:255']
      ]);


      $user = User::create($attributes);
---
INSERT INTO `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('Musa isa', 'aibrahimaa', 'auwalguramaaa30@gmail.com', '$2y$10$vuPJ4wInmBrrtRi0W1rzieqmTTBEbaHmT5z5Xw1OFSLV.soPW6FTG', '2022-05-16 17:07:29', '2022-05-16 17:07:29')